In [1]:
import pandas as pd

# Create a dataframe, dataframe is a 2D array.

# Create a dataframe from dictionary

In [ ]:
df_dict = pd.DataFrame({'Name': ['Deep','Pari','Anchal'], 'Marks': [76,67,78]})

In [5]:
df_dict

     Name  Marks
0    Deep     76
1    Pari     67
2  Anchal     78

# load csv data using pandas' read_csv method

In [7]:
df = pd.read_csv('StockData.csv')

# head() method returns the first 5 rows of the dataframe by default,otherwise mention the number of rows

In [8]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [10]:
df.head(7) # mention he number of rows in head() method

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556
5  AAPL  15-02-2013  65.7371
6  AAPL  19-02-2013  65.7128

# tail() method is used to get last rows of the dataframe, by default is 5 otherwise mention

In [11]:
df.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

# shape, shape attribute is used to get the shape of dataframe, rows and columns

In [12]:
df.shape

(5036, 3)

# Describe method gives the numeric information like, count,std,min,max,mean,25%,50%,75%

In [14]:
df.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

# Calculate mean, median, min, max

In [37]:
df.min()

stock          AAPL
date     01-02-2016
price          28.4
dtype: object

In [38]:
df.max()

stock           ZTS
date     31-12-2015
price        179.26
dtype: object

In [46]:
df['price'].mean() #takes numeric data

73.05702966640192

In [44]:
df['price'].median()

69.08500000000001

# iloc[], is used to get rows and columns, which are specified using index number of rows and columns, i is for index

In [16]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [17]:
df.iloc[0:5,1:2] # gives first 4 rows, index 5 is excluded and second column as 2 is not included

         date
0  08-02-2013
1  11-02-2013
2  12-02-2013
3  13-02-2013
4  14-02-2013

# loc[]: gives the rows and columns, specified by name of rows and columns

In [18]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [22]:
df.loc[0:4,['stock', 'price']] # last index is always included in the loc

  stock    price
0  AAPL  67.8542
1  AAPL  68.5614
2  AAPL  66.8428
3  AAPL  66.7156
4  AAPL  66.6556

# Dropping columns, axis = 1 means drop function is for columns

In [20]:
df.drop('price', axis=1)

     stock        date
0     AAPL  08-02-2013
1     AAPL  11-02-2013
2     AAPL  12-02-2013
3     AAPL  13-02-2013
4     AAPL  14-02-2013
...    ...         ...
5031   ZTS  01-02-2018
5032   ZTS  02-02-2018
5033   ZTS  05-02-2018
5034   ZTS  06-02-2018
5035   ZTS  07-02-2018

[5036 rows x 2 columns]

# Dropping columns, axis = 0, means drop function is for rows

In [21]:
df.drop([1,2,3], axis=0)

     stock        date    price
0     AAPL  08-02-2013  67.8542
4     AAPL  14-02-2013  66.6556
5     AAPL  15-02-2013  65.7371
6     AAPL  19-02-2013  65.7128
7     AAPL  20-02-2013  64.1214
...    ...         ...      ...
5031   ZTS  01-02-2018  77.8200
5032   ZTS  02-02-2018  76.7800
5033   ZTS  05-02-2018  73.8300
5034   ZTS  06-02-2018  73.2700
5035   ZTS  07-02-2018  73.8600

[5033 rows x 3 columns]

In [23]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

# apply() method is used for applying user defined function for each element of the column

In [24]:
def half(x):
    return x*0.5

In [26]:
x = df['price'].apply(half)

In [27]:
x

0       33.9271
1       34.2807
2       33.4214
3       33.3578
4       33.3278
         ...
5031    38.9100
5032    38.3900
5033    36.9150
5034    36.6350
5035    36.9300
Name: price, Length: 5036, dtype: float64

# value_counts(), is used for counting the occurrence of the each value in column

In [28]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [33]:
df['stock'].value_counts()

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

# sort_values() is used to sort values by column name

In [34]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [36]:
df.sort_values(by = 'price')

     stock        date   price
4072   ZTS  11-04-2014   28.40
4073   ZTS  14-04-2014   28.48
4075   ZTS  16-04-2014   28.53
4074   ZTS  15-04-2014   28.55
4076   ZTS  17-04-2014   28.60
...    ...         ...     ...
1247  AAPL  23-01-2018  177.04
1241  AAPL  12-01-2018  177.09
1245  AAPL  19-01-2018  178.46
1243  AAPL  17-01-2018  179.10
1244  AAPL  18-01-2018  179.26

[5036 rows x 3 columns]